/*
    Compile unit: C:\BuildAgent\cm4-build631-TSC6\cmbuild\SKU2_Code\src\target\game\simulator\utility\game_simulator_utility_unity.cpp
    Producer: MW EABI PPC C-Compiler
    Language: C++
    Code range: 0x801645FC -> 0x801645FC
*/
class basic_string_ref {
    // total size: 0x10
    char * ptr; // offset 0x0, size 0x4
    unsigned long len; // offset 0x4, size 0x4
    unsigned long res; // offset 0x8, size 0x4
    unsigned long count; // offset 0xC, size 0x4
};
class basic_string_ref defaultReference; // size: 0x10, address: 0x80493988
class simple_allocator {
    // total size: 0x1
};
class simple_allocator {
    // total size: 0x1
};
struct string_char_baggage {
    // total size: 0x1
};
class BString2 s_empty; // size: 0x4, address: 0x805DBA10
class basic_string_ref2 {
    // total size: 0x10
    unsigned short * ptr; // offset 0x0, size 0x4
    unsigned long len; // offset 0x4, size 0x4
    unsigned long res; // offset 0x8, size 0x4
    unsigned long count; // offset 0xC, size 0x4
};
class basic_string_ref2 defaultReference; // size: 0x10, address: 0x804939B0
class simple_allocator2 {
    // total size: 0x1
};
class simple_allocator2 {
    // total size: 0x1
};
struct string_wchar_baggage {
    // total size: 0x1
};
static float k1Over2Root6; // size: 0x4, address: 0x805DBA14
enum RotationAxis {
    kXAxis = 0,
    kYAxis = 1,
    kZAxis = 2,
};
static unsigned int srandSeed; // size: 0x4, address: 0x805DBA1C
class QuickStringSet : public StringSet {
    // total size: 0x14
public:
    const struct WStringSet * m_pWStringSet; // offset 0x4, size 0x4
    const struct AStringSet * m_pStringSet; // offset 0x8, size 0x4
    class ELocString m_defLocString; // offset 0xC, size 0x4
private:
    unsigned int mRefCount; // offset 0x10, size 0x4
};
unsigned short * s_nullPointer; // size: 0x4, address: 0x805DBA20
struct {
    // total size: 0x90
} __vt__14QuickStringSet; // size: 0x90, address: 0x80430088
struct {
    // total size: 0x90
} __vt__9StringSet; // size: 0x90, address: 0x80430118
struct {
    // total size: 0xC
} __vt__7MemFile; // size: 0xC, address: 0x804301A8
struct use_first {
    // total size: 0x1
};
struct pair {
    // total size: 0x8
    struct rbtree_iterator first; // offset 0x0, size 0x4
    unsigned char second; // offset 0x4, size 0x1
};

