/*
    Compile unit: C:\BuildAgent\cm4-build631-TSC6\cmbuild\SKU2_Code\src\target\game\ui\targets\game_ui_targets_cas_unity.cpp
    Producer: MW EABI PPC C-Compiler
    Language: C++
    Code range: 0x80188694 -> 0x80188694
*/
static class EVec3 kCARPlumbBobLightDir; // size: 0xC, address: 0x80493C30
class CBMemberTranslator1 : public CBFunctor1 {
    // total size: 0x14
};
class CBMemberTranslator0 : public CBFunctor0 {
    // total size: 0x14
};
class CBMemberTranslator1wRet : public CBFunctor1wRet {
    // total size: 0x14
};
class CBMemberTranslator2 : public CBFunctor2 {
    // total size: 0x14
};
class CBMemberTranslator1wRet : public CBFunctor1wRet {
    // total size: 0x14
};
class CBMemberTranslator1 : public CBFunctor1 {
    // total size: 0x14
};
unsigned int kGRID_SHADERS_IDS[17]; // size: 0x44, address: 0x8041C038
class ERShader * s_pGridIconShaders[17]; // size: 0x44, address: 0x80493C3C
class ERAnim * * s_pIdleAnimations; // size: 0x4, address: 0x805DBAA8
class ERCharacter * s_pIdleAnimCharacters; // size: 0x4, address: 0x805DBAAC
class CBMemberTranslator1 : public CBFunctor1 {
    // total size: 0x14
};
class CBMemberTranslator0 : public CBFunctor0 {
    // total size: 0x14
};
class CBMemberTranslator1wRet : public CBFunctor1wRet {
    // total size: 0x14
};
class CBMemberTranslator2 : public CBFunctor2 {
    // total size: 0x14
};
class CBMemberTranslator1wRet : public CBFunctor1wRet {
    // total size: 0x14
};
class CASGridTarget : public UIObjectBase, public CasListener {
    // total size: 0x1A0
    int m_highlightOption; // offset 0xAC, size 0x4
    int m_startOption; // offset 0xB0, size 0x4
    int m_totalOptions; // offset 0xB4, size 0x4
    int m_partUIFocus; // offset 0xB8, size 0x4
    int m_buttonFilter; // offset 0xBC, size 0x4
    class ERShader * m_pIconShaders[16]; // offset 0xC0, size 0x40
    class ERShader * m_pBlankShader; // offset 0x100, size 0x4
    class vector m_partList; // offset 0x104, size 0x10
    unsigned char m_partUIFocusIsMale; // offset 0x114, size 0x1
    class WiiMoteToGridInteractor m_WiiMoteToGridInteractor; // offset 0x118, size 0x30
    class CursorMovementTracker m_CursorTracker; // offset 0x148, size 0x50
    class EVec2 m_CursorPoint; // offset 0x198, size 0x8
};
class CasEventStoreCharacter : public CasEvent {
    // total size: 0x8
};
class CBMemberTranslator1 : public CBFunctor1 {
    // total size: 0x14
};
class CASArchetypeTarget : public UIObjectBase, public CasListener {
    // total size: 0x478
    enum eArchetype m_selectedArchetype; // offset 0xAC, size 0x4
    class UIStringGenerator m_archetypeShaderTable; // offset 0xB0, size 0x8
    int m_buttonFilter; // offset 0xB8, size 0x4
    class CasSimDescription m_storedSimDescription; // offset 0xBC, size 0x334
    class WiiMoteToGridInteractor m_WiiMoteToGridInteractor; // offset 0x3F0, size 0x30
    class CursorMovementTracker m_CursorTracker; // offset 0x420, size 0x50
    class EVec2 m_CursorPoint; // offset 0x470, size 0x8
};
class CBMemberTranslator1 : public CBFunctor1 {
    // total size: 0x14
};
class CBMemberTranslator0 : public CBFunctor0 {
    // total size: 0x14
};
class CBMemberTranslator1wRet : public CBFunctor1wRet {
    // total size: 0x14
};
class CBMemberTranslator2 : public CBFunctor2 {
    // total size: 0x14
};
class CBMemberTranslator1wRet : public CBFunctor1wRet {
    // total size: 0x14
};
char * const GridGadgetShaderTable[16]; // size: 0x40, address: 0x8041C080
class CBMemberTranslator1 : public CBFunctor1 {
    // total size: 0x14
};
class CBMemberTranslator0 : public CBFunctor0 {
    // total size: 0x14
};
class CBMemberTranslator1wRet : public CBFunctor1wRet {
    // total size: 0x14
};
class CBMemberTranslator2 : public CBFunctor2 {
    // total size: 0x14
};
class CBMemberTranslator1wRet : public CBFunctor1wRet {
    // total size: 0x14
};
class CBMemberTranslator1 : public CBFunctor1 {
    // total size: 0x14
};
class CBMemberTranslator0 : public CBFunctor0 {
    // total size: 0x14
};
class CBMemberTranslator1wRet : public CBFunctor1wRet {
    // total size: 0x14
};
class CBMemberTranslator2 : public CBFunctor2 {
    // total size: 0x14
};
class CBMemberTranslator1wRet : public CBFunctor1wRet {
    // total size: 0x14
};
struct {
    // total size: 0x10
} __vt__22CasEventStoreCharacter; // size: 0x10, address: 0x80441558
struct {
    // total size: 0x10
} __vt__22CasEventResetCharacter; // size: 0x10, address: 0x80441568
struct {
    // total size: 0x10
} __vt__22CasEventSetMorphRegion; // size: 0x10, address: 0x80441578
struct {
    // total size: 0x54
} __vt__13CASGridTarget; // size: 0x54, address: 0x80441588
struct {
    // total size: 0x54
} __vt__18CASArchetypeTarget; // size: 0x54, address: 0x804415DC
struct {
    // total size: 0x54
} __vt__17CASPersonalTarget; // size: 0x54, address: 0x80441630
struct {
    // total size: 0x10
} __vt__19CasEventChangeFocus; // size: 0x10, address: 0x80441698
struct {
    // total size: 0x54
} __vt__9CAFTarget; // size: 0x54, address: 0x804416B8
struct {
    // total size: 0x8C
} __vt__13CASTargetTSC6; // size: 0x8C, address: 0x8044170C
class generic_iterator {
    // total size: 0x4
protected:
    struct CASUIScreenState * mIterator; // offset 0x0, size 0x4
};

